perf/exchange_load.yaml
config:
  environments:
    api:
      target: "http://localhost:5555"
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-api"
  pool: 50 # All HTTP requests from all virtual users will be sent over the same connections

  phases:
    - name: Ramp up load
      duration: 30
      arrivalRate: 100
      rampTo: 200
    - name: Plain load
      duration: 30
      arrivalRate: 200
    - name: Ramp up load 2
      duration: 30
      arrivalRate: 200
      rampTo: 300
    - name: Plain load 2
      duration: 30
      arrivalRate: 300
    - name: Ramp up load 3
      duration: 30
      arrivalRate: 300
      rampTo: 400
    - name: Plain load 3
      duration: 30
      arrivalRate: 400
    - name: Ramp up load 4
      duration: 30
      arrivalRate: 400
      rampTo: 500
    - name: Plain load 4
      duration: 30
      arrivalRate: 500
    - name: Ramp up load 5
      duration: 30
      arrivalRate: 500
      rampTo: 600
    - name: Plain load 5
      duration: 30
      arrivalRate: 600
    - name: Ramp up load 6
      duration: 30
      arrivalRate: 600
      rampTo: 700
    - name: Plain load 6
      duration: 30
      arrivalRate: 700
    - name: Ramp up load 7
      duration: 30
      arrivalRate: 700
      rampTo: 800
    - name: Plain load 7
      duration: 30
      arrivalRate: 800
    

scenarios:
  - name: Exchange Load (/exchange)
    flow:
      - post:
          url: '/exchange'
          json:
            baseCurrency: "ARS"
            counterCurrency: "EUR"
            baseAccountId: 2
            counterAccountId: 3
            baseAmount: 1.0