perf/exchange_spike.yaml
config:
  environments:
    api:
      target: "http://localhost:5555"
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-api"
  pool: 50 # All HTTP requests from all virtual users will be sent over the same connections

  phases:
  - name: Warmup
    duration: 30
    arrivalRate: 10
    rampTo: 100
  - name: Load Spike
    duration: 30
    arrivalRate: 200
  - name: Plain load 2
    duration: 30
    arrivalRate: 100
  - name: Load Spike 2
    duration: 30
    arrivalRate: 400
  - name: Plain load 3
    duration: 30
    arrivalRate: 100
  - name: Load Spike 3
    duration: 30
    arrivalRate: 600
  - name: Plain load 4
    duration: 30
    arrivalRate: 100
  - name: Load Spike 4
    duration: 30
    arrivalRate: 800
  - name: Plain load 5
    duration: 30
    arrivalRate: 100
  - name: Load Spike 5
    duration: 30
    arrivalRate: 1000
scenarios:
  - name: Exchange Spike (/exchange)
    flow:
      - post:
          url: '/exchange'
          json:
            baseCurrency: "ARS"
            counterCurrency: "EUR"
            baseAccountId: 2
            counterAccountId: 3
            baseAmount: 1.0